# LineWeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSystemType..::..LineWeight Property
MEPSystemType Class See Also
---
Indicates the weight that should override the line weight for all components in the system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int LineWeight { get; set; }
```

Visual Basic
---
```text
Public Property LineWeight As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int LineWeight {
	int get ();
	void set (int value);
}
```

# See Also
MEPSystemType Class
Autodesk.Revit.DB Namespace